Revit 2027 API
FamilyInstance.HasSweptProfile Method
Indicates if this instance can be represented as a swept profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSweptProfile()
Public Function HasSweptProfile As Boolean
public:
bool HasSweptProfile()
member HasSweptProfile : unit -> bool
Return Value
Boolean
True if the instance can be represented as a swept profile, false otherwise.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace